Revit 2026 API

# WorksharingTooltipInfo Methods

---

The WorksharingTooltipInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRequesters | The ordered list of unique user names of users who have outstanding editing requests for the specified element. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

WorksharingTooltipInfo Class

Autodesk.Revit.DB Namespace